In [1]:
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('train.csv',usecols=['Age','Fare','Survived'])

In [3]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [4]:
df.isnull().mean() * 100

Survived     0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [5]:
X = df.drop(columns=['Survived'])
y = df['Survived']

In [6]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [7]:
X_train

      Age      Fare
30   40.0   27.7208
10    4.0   16.7000
873  47.0    9.0000
182   9.0   31.3875
876  20.0    9.8458
..    ...       ...
534  30.0    8.6625
584   NaN    8.7125
493  71.0   49.5042
527   NaN  221.7792
168   NaN   25.9250

[712 rows x 2 columns]

In [8]:
X_train['Age_imputed'] = X_train['Age']
X_test['Age_imputed'] = X_test['Age']

<ipython-input-8-55cc01c98bba>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_train['Age_imputed'] = X_train['Age']
<ipython-input-8-55cc01c98bba>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X_test['Age_imputed'] = X_test['Age']

In [9]:
X_test.tail()

      Age     Fare  Age_imputed
89   24.0   8.0500         24.0
80   22.0   9.0000         22.0
846   NaN  69.5500          NaN
870  26.0   7.8958         26.0
251  29.0  10.4625         29.0

In [10]:
X_train['Age_imputed'][X_train['Age_imputed'].isnull()] = X_train['Age'].dropna().sample(X_train['Age'].isnull().sum()).values
X_test['Age_imputed'][X_test['Age_imputed'].isnull()] = X_train['Age'].dropna().sample(X_test['Age'].isnull().sum()).values

C:\Users\ekss01905\Anaconda3\lib\site-packages\pandas\core\series.py:992: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)

In [11]:
X_train['Age'].dropna().sample(X_train['Age'].isnull().sum()).values

array([30.  , 24.  , 30.  , 36.  , 38.  , 17.  , 48.  , 34.5 , 25.  ,
       36.  , 34.  , 50.  , 42.  , 45.  , 26.  , 22.  ,  3.  , 27.  ,
       20.  , 21.  , 19.  , 21.  , 24.  , 42.  ,  5.  , 37.  , 25.  ,
       39.  , 38.  , 35.  ,  6.  , 33.  , 44.  , 39.  , 70.  , 30.  ,
       35.  , 28.  , 38.  ,  4.  , 27.  , 45.  , 36.  , 62.  , 24.  ,
       54.  , 26.  ,  0.75, 52.  , 22.  , 19.  , 62.  , 50.  , 45.5 ,
       21.  , 23.  , 28.  , 40.  , 32.  , 65.  , 56.  , 32.  , 24.  ,
       60.  , 63.  , 24.  , 35.  , 25.  , 39.  , 32.  , 27.  , 48.  ,
       22.  , 32.5 , 17.  , 54.  , 21.  , 45.  , 28.  , 30.  , 29.  ,
       36.  , 33.  , 18.  , 33.  ,  4.  , 25.  , 13.  , 26.  ,  2.  ,
       29.  ,  9.  , 16.  , 43.  , 19.  ,  1.  , 34.  , 42.  , 29.  ,
       57.  , 39.  , 22.  , 34.  , 33.  ,  7.  , 45.  , 45.5 , 49.  ,
       32.  ,  9.  , 29.  , 19.  , 33.  , 21.  ,  8.  , 26.  , 24.  ,
       23.  , 25.  , 22.  , 28.  , 34.  , 19.  , 21.  , 18.  , 50.  ,
       31.  , 24.  , 22.  , 40.  , 58.  , 16.  , 40.  , 30.  , 39.  ,
       28.5 , 27.  , 27.  , 25.  , 52.  , 37.  , 46.  , 31.  , 21.  ,
       40.  , 30.  , 11.  , 33.  ])

In [12]:
X_train['Age'].isnull().sum()

148

In [13]:
X_train

      Age      Fare  Age_imputed
30   40.0   27.7208         40.0
10    4.0   16.7000          4.0
873  47.0    9.0000         47.0
182   9.0   31.3875          9.0
876  20.0    9.8458         20.0
..    ...       ...          ...
534  30.0    8.6625         30.0
584   NaN    8.7125         30.0
493  71.0   49.5042         71.0
527   NaN  221.7792         21.0
168   NaN   25.9250         39.0

[712 rows x 3 columns]

In [20]:
X_train['Age'].dropna().sample(1)

24    8.0
Name: Age, dtype: float64

In [24]:
sampled_value = X_train['Age'].dropna().sample(1)